src/cf/Catalogs/ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещениеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТокенаАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТокеновАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроизводственныйОбъектИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответственные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВСекундах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыТокеновАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыТокеновАвторизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СУЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИСМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИСМПРозница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипТокенаАвторизации = Перечисления.ТипыТокеновАвторизации.ИСМП
		И ЗначениеЗаполнено(ПроизводственныйОбъект) Тогда
		ПроизводственныйОбъект = Неопределено;
	КонецЕсли;
	
	Реквизиты = ЭтотОбъект.Метаданные().Реквизиты;
	
	ДлинаПоляОтветственные = Реквизиты.ОтветственныеСтрокой.Тип.КвалификаторыСтроки.Длина;
	ДлинаПоляОповещение    = Реквизиты.ОповещениеСтрокой.Тип.КвалификаторыСтроки.Длина;
	
	ПредставлениеЧасов = НСтр("ru = ';%1 час;;%1 часа;%1 часов;%1 часа'");
	ПредставлениеМинут = НСтр("ru = ';%1 минута;;%1 минуты;%1 минут;%1 минуты'");
	
	ТаблицаОтветственных = Ответственные.Выгрузить();
	ТаблицаОтветственных.Сортировать("ВремяВСекундах Убыв");
	
	МассивОтветственные = Новый Массив;
	МассивВремени       = Новый Массив;
	
	Для Каждого Строка Из ТаблицаОтветственных Цикл
		// Ответственные
		Если МассивОтветственные.Найти(Строка.Ответственный) = Неопределено Тогда
			МассивОтветственные.Добавить(Строка.Ответственный);
		КонецЕсли;
		
		// Время
		Время = Цел(Строка.ВремяВСекундах / 3600);
		
		Если Время > 0 Тогда
			ТипВремени = ПредставлениеЧасов;
		Иначе
			Время = Цел(Строка.ВремяВСекундах / 60);
			ТипВремени = ПредставлениеМинут;
		КонецЕсли;
		
		ПредставлениеВремени = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ТипВремени, Время);
		
		Если МассивВремени.Найти(ПредставлениеВремени) = Неопределено Тогда
			МассивВремени.Добавить(ПредставлениеВремени);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивВремени.Количество() > 0 Тогда
		МассивВремени[0] = СтрШаблон(НСтр("ru = 'за %1'"), МассивВремени[0]);
	КонецЕсли;
	
	ОтветственныеСтрокой = СформироватьПредставлениеМассиваДанных(
		МассивОтветственные, ДлинаПоляОтветственные);
	
	ОповещениеСтрокой = СформироватьПредставлениеМассиваДанных(
		МассивВремени, ДлинаПоляОповещение);
	
	Если ОбщегоНазначенияИСКлиентСервер.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПредставлениеМассиваДанных(МассивДанных, ДлинаПоля)
	
	КоличествоДанных = МассивДанных.Количество();
	
	Если КоличествоДанных = 0 Тогда
		Возврат НСтр("ru = '<данные отсутствуют>'");;
	КонецЕсли;
	
	Разделитель            = ", ";
	ТекстОкончанияЭлемента = "...";
	ДлинаОкончанияЭлемента = СтрДлина(ТекстОкончанияЭлемента);
	ТекстОкончанияСтроки   = НСтр("ru = ' ( + еще %1 )'");
	ДлинаОкончанияСтроки   = СтрДлина(ТекстОкончанияСтроки);
	МаксимальнаяДлина      = ДлинаПоля - ДлинаОкончанияСтроки;
	Представление          = "";
	ПредставлениеДлина     = 0;
	КоличествоДобавлено    = 0;
	
	Для Каждого Элемент Из МассивДанных Цикл
		
		ТекущееПредставление = СокрЛП(Элемент);
		Если КоличествоДобавлено > 0 Тогда
			ТекущееПредставление = Разделитель + ТекущееПредставление;
		КонецЕсли;
			
		ПредставлениеДлина = ПредставлениеДлина + СтрДлина(ТекущееПредставление);
		
		Если КоличествоДанных = КоличествоДобавлено + 1 Тогда
			МаксимальнаяДлина = МаксимальнаяДлина + ДлинаОкончанияСтроки;
		КонецЕсли;
		
		Если ПредставлениеДлина > МаксимальнаяДлина Тогда
			
			Если КоличествоДобавлено = 0 Тогда
				Представление = Лев(ТекущееПредставление,
					МаксимальнаяДлина - ДлинаОкончанияЭлемента) + ТекстОкончанияЭлемента;
				КоличествоДобавлено = КоличествоДобавлено + 1;
			КонецЕсли;
			
			Если КоличествоДанных > 1 Тогда
				Представление = Представление + СтрШаблон(
					ТекстОкончанияСтроки, КоличествоДанных - КоличествоДобавлено);
			КонецЕсли;
		
			Прервать;
			
		КонецЕсли;
		
		Представление = Представление + ТекущееПредставление;
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#КонецЕсли
